foamCase/constant/polyMesh/blockMeshDict
FoamFile{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (-16.626216 -3.545270 0.000000)
    (12.206524 -11.832192 0.000000)
    (16.626216 3.545270 0.000000)
    (-12.206524 11.832192 0.000000)
    (-16.626216 -3.545270 8.000000)
    (12.206524 -11.832192 8.000000)
    (16.626216 3.545270 8.000000)
    (-12.206524 11.832192 8.000000)
);
blocks
(
    hex (0 1 2 3 4 5 6 7)(20 20 20) simpleGrading (1.000000 1.000000 1.000000)
);
edges
(
);
boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);
